Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement Property
 An error occurred while trimming the vertical shadow of a room-bounding element [Name] of the bounding geometry for [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomGeometryCannotTrimBoundingElement { get; }
Public Shared ReadOnly Property RoomGeometryCannotTrimBoundingElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomGeometryCannotTrimBoundingElement {
	FailureDefinitionId^ get ();
}
static member RoomGeometryCannotTrimBoundingElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace